import requests
from bs4 import BeautifulSoup

import json

from selenium import webdriver
from selenium.webdriver.chrome.options import Options


from pymongo import MongoClient

# client = MongoClient('mongodb://test:test@localhost', 27017)
client = MongoClient('localhost', 27017)
db = client.cinema

# 영화 랭킹
headers = {'User-Agent' : 'Mozilla/5.0 (Windows NT 10.0; Win64; x64)AppleWebKit/537.36 (KHTML, like Gecko) Chrome/73.0.3683.86 Safari/537.36'}
data = requests.get('https://movie.naver.com/movie/running/current.naver',headers=headers)
soup = BeautifulSoup(data.text, 'html.parser')
trs = soup.select('#content > div.article > div:nth-child(1) > div.lst_wrap > ul > li')
for tr in trs:
    url = 'https://movie.naver.com/' + tr.select_one('dl > dt > a').attrs['href']
    raw_each = requests.get(url, headers=headers)
    soup_each = BeautifulSoup(raw_each.text, 'html.parser')
    trs_each = soup_each.select('#content > div.article > div.mv_info_area')
    for tr_each in trs_each:
        title = tr_each.select_one('a').text
        all_img = tr_each.select_one('a > img')
        if all_img is None:
            img = "https://ssl.pstatic.net/static/movie/2012/06/dft_img203x290.png"
        else :
            img = all_img.attrs['src']
        all_genre = tr_each.select_one('dl > dd:nth-child(2) > p > span:nth-child(1)').text
        genre = ''.join(all_genre.split())
        all_country = tr_each.select_one('dl > dd:nth-child(2) > p > span:nth-child(2)').text
        country = ''.join(all_country.split())
        time = tr_each.select_one('dl > dd:nth-child(2) > p > span:nth-child(3)').text
        director = tr_each.select_one('dl > dd:nth-child(4)').text
        stars = tr_each.select_one('dl > dd:nth-child(6) > p').text
        all_date = tr_each.select_one('div > dl > dd:nth-child(2) > p > span:nth-child(4)')
        if all_date is not None:
            re_all_date = all_date = tr_each.select_one('div > dl > dd:nth-child(2) > p > span:nth-child(4)').text        
            date = ''.join(all_date.split())
        doc1 = {
            'url' : url,
            'title' : title,
            'img' : img,            
            'genre' : genre,
            'country' : country,
            'time' : time,
            'date' : date,
            'director' : director,
            'stars' : stars
        }
    db.poster.insert_one(doc1)


# CGV
headers = {'User-Agent' : 'Mozilla/5.0 (Windows NT 10.0; Win64; x64)AppleWebKit/537.36 (KHTML, like Gecko) Chrome/73.0.3683.86 Safari/537.36'}
data = requests.get('http://www.cgv.co.kr/culture-event/event/defaultNew.aspx?mCode=001#1',headers=headers)
soup = BeautifulSoup(data.text, 'html.parser')
text = str(soup).split('var jsonData = ')[1]
text = text.split(';')[0]
decode_json = json.loads(text)
cgvLink = 'http://www.cgv.co.kr/culture-event/event/'
for data in decode_json:
    db.MovieMap_CGV.insert_one({
        'idx' : data['idx'],
        'image' : data['imageUrl'],
        'link' : cgvLink + data['link'].split('./')[1],
        'description' : data['description'],
        'eventTerm': data['eventTerm'],
        'spanDay': data['spanDay']
    })


# 롯데시네마
# ubuntu 사용 시 아래 4줄 활성화
# chrome_options = Options()
# chrome_options.add_argument("--headless")
# chrome_options.add_argument('--no-sandbox')
# driver = webdriver.Chrome('/home/ubuntu/team10/chromedriver', options=chrome_options)
# local 환경 사용 시 아래 1줄 활성화
driver = webdriver.Chrome(r'C:/Users/CPT/Desktop/10조_메이킹 챌린지/chromedriver')
driver.implicitly_wait(3)  # 암묵적으로 웹 자원을 (최대) 3초 기다리기
driver.get('https://event.lottecinema.co.kr/NLCHS/Event/DetailList?code=20')
driver.find_element_by_xpath("//button[@class='btn_txt_more']").click()
driver.implicitly_wait(3)
html = driver.page_source
soup = BeautifulSoup(html, 'html.parser')
lis = soup.select('#contents > ul > li')
for li in lis:
    name = li.select_one('a > img')
    des = li.select_one('a > img')['alt']
    img = str(name).split('src="')[1].split('"')[0]
    date = li.select_one('a > div').text
    doc = {
        'des': des,
        'img': img,
        'date': date
    }
    db.MovieMaplotte.insert_one(doc)


# 메가박스
# ubuntu 사용 시 아래 4줄 활성화
# chrome_options = Options()
# chrome_options.add_argument("--headless")
# chrome_options.add_argument('--no-sandbox')
# driver = webdriver.Chrome('/home/ubuntu/team10/chromedriver', options=chrome_options)
# local 환경 사용 시 아래 1줄 활성화
driver = webdriver.Chrome(r'C:/Users/CPT/Desktop/10조_메이킹 챌린지/chromedriver')
driver.implicitly_wait(3)  # 암묵적으로 웹 자원을 (최대) 3초 기다리기
driver.get('https://www.megabox.co.kr/event/movie')
driver.implicitly_wait(3)
html = driver.page_source
soup = BeautifulSoup(html, 'html.parser')
lis = soup.select('#event-list-wrap > div > div > ul > li')
for li in lis:
    img = str(li.select_one('a > p.img > img')).split('src="')[1].split('"')[0]
    title = li.select_one('a > p.tit').text.strip()
    date = li.select_one('a > p.date').text.strip()

    doc = {
        'title': title,
        'img': img,
        'date': date
    }

    db.MovieMapMega.insert_one(doc)
driver.quit()


# 상영관 위치
theaters = list(db.theater.find({}, {'_id': False}))
data = []
for theater in theaters:    
    dict = {
        'name' : theater["name"][0],
        'Lat' : theater["name"][1],
        'Lng' : theater["name"][2]
    }
    data.append(dict)
db.theater.insert_many([

    {"area": "경상남도", "name": ("롯데시네마 거창", 35.68738625, 127.9131332)},
    {"area": "경상남도", "name": ("롯데시네마 김해부원", 35.22594995, 128.8841709)},
    {"area": "경상남도", "name": ("롯데시네마 마산(합성동)", 35.23855192, 128.5832866)},
    {"area": "경상남도", "name": ("롯데시네마 김해아울렛(장유)", 35.18522884, 128.8285101)},
    {"area": "경상남도", "name": ("롯데시네마 엠비씨네(진주)", 35.16395042, 128.1077424)},
    {"area": "경상남도", "name": ("롯데시네마 진주혁신(롯데몰)", 35.18056266, 128.1402359)},
    {"area": "경상남도", "name": ("롯데시네마 진해", 35.15894944, 128.6973343)},
    {"area": "경상남도", "name": ("롯데시네마 창원", 35.22430195, 128.6818732)},
    {"area": "경상남도", "name": ("롯데시네마 통영", 34.85896662, 128.1077424)},
    {"area": "경상남도", "name": ("롯데시네마 프리미엄경남대", 35.18078888, 128.5597545)},
    {"area": "경상남도", "name": ("롯데시네마 프리미엄진주(중안)", 35.19289805, 128.0826651)},
    {"area": "경상북도", "name": ("롯데시네마 경산", 35.834427354, 128.7333273)},
    {"area": "경상북도", "name": ("롯데시네마 경주", 35.841555493, 129.2131419)},
    {"area": "경상북도", "name": ("롯데시네마 경주황성", 35.88083038, 129.2181074)},
    {"area": "경상북도", "name": ("롯데시네마 구미공단", 36.10441235, 128.3851006)},
    {"area": "경상북도", "name": ("롯데시네마 상주", 36.41606823, 128.1543825)},
    {"area": "경상북도", "name": ("롯데시네마 영주", 36.82724644, 128.6177702)},
    {"area": "경상북도", "name": ("롯데시네마 영천", 35.96285477, 128.9409308)},
    {"area": "경상북도", "name": ("롯데시네마 포항", 36.03653752, 129.3629110)},
    {"area": "경상북도", "name": ("롯데시네마 프리미엄구미센트럴", 36.12899966, 128.3348580)},
    {"area": "경상북도", "name": ("롯데시네마 프리미엄안동", 36.56617876, 128.6996905)},
    {"area": "대구", "name": ("롯데시네마 대구광장", 35.85570044, 128.5507053)},
    {"area": "대구", "name": ("롯데시네마 대구율하", 35.86876996, 128.6927801)},
    {"area": "대구", "name": ("롯데시네마 대구현풍", 35.69311918, 128.4563388)},
    {"area": "대구", "name": ("롯데시네마 동성로", 35.87017441, 128.5968068)},
    {"area": "대구", "name": ("롯데시네마 상인", 35.81646710, 128.5392650)},
    {"area": "대구", "name": ("롯데시네마 성서", 35.85437258, 35.85437258)},
    {"area": "대구", "name": ("롯데시네마 프리미엄만경", 35.87089257, 128.5904262)},
    {"area": "대구", "name": ("롯데시네마 프리미엄칠곡", 35.94209429, 128.5638168)},
    {"area": "부산", "name": ("롯데시네마 광복", 35.097911487, 129.0363136)},
    {"area": "부산", "name": ("롯데시네마 대영", 35.098622941, 129.0294649)},
    {"area": "부산", "name": ("롯데시네마 동래", 35.211926407, 129.0771869)},
    {"area": "부산", "name": ("롯데시네마 동부산아울렛", 35.19232787, 129.2113989)},
    {"area": "부산", "name": ("롯데시네마 드라이브 오시리아", 35.20124800, 129.2252212)},
    {"area": "부산", "name": ("롯데시네마 부산명지", 35.09290686, 128.9109832)},
    {"area": "부산", "name": ("롯데시네마 부산본점", 35.15636767, 129.0556797)},
    {"area": "부산", "name": ("롯데시네마 사상", 35.16298577, 128.9834893)},
    {"area": "부산", "name": ("롯데시네마 서면(전포동)", 35.15679067, 129.0628139)},
    {"area": "부산", "name": ("롯데시네마 센텀시티", 35.17008869, 129.1310562)},
    {"area": "부산", "name": ("롯데시네마 오투(부산대)", 35.22830857, 129.0897907)},
    {"area": "부산", "name": ("롯데시네마 프리미엄해운대(장산역)", 35.16926022, 129.1766177)},
    {"area": "울산", "name": ("롯데시네마 울산(백화점)", 35.53873509, 129.3388303)},
    {"area": "울산", "name": ("롯데시네마 울산성남", 35.55313143, 129.3201294)},
    {"area": "전라북도", "name": ("롯데시네마 군산나운", 35.96430790, 126.7054955)},
    {"area": "전라북도", "name": ("롯데시네마 군산몰", 35.97614726, 126.7384925)},
    {"area": "전라북도", "name": ("롯데시네마 익산모현", 35.94967749, 126.9400715)},
    {"area": "전라북도", "name": ("롯데시네마 전주(백화점)", 35.83446356, 127.1218393)},
    {"area": "전라북도", "name": ("롯데시네마 전주평화", 35.79622961, 127.1326841)},
    {"area": "광주", "name": ("롯데시네마 광주(백화점)", 35.14679560, 126.9146994,)},
    {"area": "광주", "name": ("롯데시네마 광주광산", 35.15429464, 126.8510127)},
    {"area": "광주", "name": ("롯데시네마 수완(아울렛)", 35.19031556, 126.8198379)},
    {"area": "광주", "name": ("롯데시네마 충장로", 35.148053782, 126.9145203)},
    {"area": "제주도", "name": ("롯데시네마 서귀포", 33.24654336, 126.5081213)},
    {"area": "제주도", "name": ("롯데시네마 제주삼화지구", 33.52045282, 126.5882003)},
    {"area": "제주도", "name": ("롯데시네마 제주아라", 33.48382466, 126.5359081)},
    {"area": "대전", "name": ("롯데시네마 대전(백화점)", 36.34097538, 127.3893592)},
    {"area": "대전", "name": ("롯데시네마 대전관저", 36.30254434, 127.3337185)},
    {"area": "대전", "name": ("롯데시네마 대전둔산(월평동)", 36.36178611, 127.3790206)},
    {"area": "대전", "name": ("롯데시네마 대전센트럴", 36.351950955, 127.3795076)},
    {"area": "충청남도", "name": ("롯데시네마 당진", 36.88716675, 126.6466740)},
    {"area": "충청남도", "name": ("롯데시네마 서산", 36.77874285, 126.4656437)},
    {"area": "충청남도", "name": ("롯데시네마 아산터미널", 36.78492777, 127.0160247)},
    {"area": "충청북도", "name": ("롯데시네마 서청주", 36.64517411, 127.4216416)},
    {"area": "충청북도", "name": ("롯데시네마 청주용암", 36.60702860, 127.5030850)},
    {"area": "충청북도", "name": ("롯데시네마 충주", 36.96150582, 127.8985650)},
    {"area": "충청북도", "name": ("롯데시네마 남원주", 37.33087898, 127.9488187)},
    {"area": "충청북도", "name": ("롯데시네마 동해", 37.52223068, 129.1152644)},
    {"area": "충청북도", "name": ("롯데시네마 속초", 38.20324636, 128.5889891)},
    {"area": "충청북도", "name": ("롯데시네마 원주무실", 37.33490575, 127.9301512)},
    {"area": "충청북도", "name": ("롯데시네마 춘천", 37.87787503, 127.7286756)},
    {"area": "인천", "name": ("롯데시네마 부평", 37.49352697, 126.7266500)},
    {"area": "인천", "name": ("롯데시네마 부평역사", 37.48975484, 126.7233303)},
    {"area": "인천", "name": ("롯데시네마 영종하늘도시", 37.48963426, 126.5614515)},
    {"area": "인천", "name": ("롯데시네마 인천아시아드", 37.54759966, 126.6676564)},
    {"area": "인천", "name": ("롯데시네마 인천터미널", 37.44210819, 126.7016739)},
    {"area": "경기도", "name": ("롯데시네마 광교아울렛", 37.28666321, 127.0559246)},
    {"area": "경기도", "name": ("롯데시네마 광명(광명사거리)", 37.47945423, 127.0559246)},
    {"area": "경기도", "name": ("롯데시네마 광명아울렛", 37.42499596, 126.8841627)},
    {"area": "경기도", "name": ("롯데시네마 광주터미널", 37.40901780, 127.2612865)},
    {"area": "경기도", "name": ("롯데시네마 구리아울렛", 37.61221566, 127.1404302)},
    {"area": "경기도", "name": ("롯데시네마 동탄", 37.20076911, 127.0978281)},
    {"area": "경기도", "name": ("롯데시네마 라페스타", 37.661104856, 126.7691056)},
    {"area": "경기도", "name": ("롯데시네마 마석", 37.650347579, 127.3093964)},
    {"area": "경기도", "name": ("롯데시네마 병점", 37.214086940, 127.0426119)},
    {"area": "경기도", "name": ("롯데시네마 별내", 37.644323787, 127.1271996)},
    {"area": "경기도", "name": ("롯데시네마 부천", 37.502772467, 126.7731792)},
    {"area": "경기도", "name": ("롯데시네마 부천역", 37.485699298, 126.7822672)},
    {"area": "경기도", "name": ("롯데시네마 북수원(천천동)", 37.30060539, 126.9840739)},
    {"area": "경기도", "name": ("롯데시네마 산본피트인", 37.35801064, 126.9305269)},
    {"area": "경기도", "name": ("롯데시네마 서수원", 37.27498644, 126.9540873)},
    {"area": "경기도", "name": ("롯데시네마 성남중앙(신흥역)", 37.44107651, 127.1465779)},
    {"area": "경기도", "name": ("롯데시네마 센트럴락", 37.31857039,  126.8380396)},
    {"area": "경기도", "name": ("롯데시네마 송탄", 37.06728892, 127.0609030)},
    {"area": "경기도", "name": ("롯데시네마 수원(수원역)", 37.26438103, 126.9968659)},
    {"area": "경기도", "name": ("롯데시네마 수지", 37.31303098, 127.0810960)},
    {"area": "경기도", "name": ("롯데시네마 시화", 37.35139081, 126.7418489)},
    {"area": "경기도", "name": ("롯데시네마 안산", 37.35139081, 126.7418489)},
    {"area": "경기도", "name": ("롯데시네마 안산고잔", 37.30886586, 126.8287971)},
    {"area": "경기도", "name": ("롯데시네마 안성", 37.31818813, 126.8459737)},
    {"area": "경기도", "name": ("롯데시네마 안양역", 37.40171962, 126.9223005)},
    {"area": "경기도", "name": ("롯데시네마 안양일번가", 37.39968735, 126.9202426)},
    {"area": "경기도", "name": ("롯데시네마 오산(원동)", 37.14226196, 127.0739012)},
    {"area": "경기도", "name": ("롯데시네마 용인기흥", 37.27415407, 127.1165393)},
    {"area": "경기도", "name": ("롯데시네마 용인역북", 37.23524532, 127.1879604)},
    {"area": "경기도", "name": ("롯데시네마 위례", 37.47271118, 127.1412789)},
    {"area": "경기도", "name": ("롯데시네마 의정부민락", 37.74418460, 127.0965500)},
    {"area": "경기도", "name": ("롯데시네마 인덕원", 37.40033716, 126.9761990)},
    {"area": "경기도", "name": ("롯데시네마 주엽", 37.67069317, 126.7610169)},
    {"area": "경기도", "name": ("롯데시네마 진접", 37.71203424, 127.1866632)},
    {"area": "경기도", "name": ("롯데시네마 파주운정", 37.72987997, 126.7365171)},
    {"area": "경기도", "name": ("롯데시네마 판교(창조경제밸리)", 37.41315414, 127.0986639)},
    {"area": "경기도", "name": ("롯데시네마 평촌(범계역)", 37.39068836, 126.9507465)},
    {"area": "경기도", "name": ("롯데시네마 평택비전(뉴코아)", 36.99554980, 127.1124955)},
    {"area": "경기도", "name": ("롯데시네마 하남미사", 37.55814366, 127.2044775)},
    {"area": "경기도", "name": ("롯데시네마 향남", 37.11515684, 126.9124804)},
    {"area": "서울", "name": ("롯데시네마 가산디지털", 37.47801996, 126.8891458)},
    {"area": "서울", "name": ("롯데시네마 가양", 37.56153300, 126.8535916)},
    {"area": "서울", "name": ("롯데시네마 강동", 37.536621229, 127.1253373)},
    {"area": "서울", "name": ("롯데시네마 건대입구", 37.53860688, 127.0729226)},
    {"area": "서울", "name": ("롯데시네마 김포공항", 37.56370976, 126.8038716)},
    {"area": "서울", "name": ("롯데시네마 노원", 37.65516309, 127.0611227)},
    {"area": "서울", "name": ("롯데시네마 도곡", 37.48747450, 127.0471052)},
    {"area": "서울", "name": ("롯데시네마 독산", 37.46943129, 126.8968409)},
    {"area": "서울", "name": ("롯데시네마 브로드웨이(신사)", 37.51642938, 127.0219001)},
    {"area": "서울", "name": ("롯데시네마 서울대입구", 37.48097343, 126.9521503)},
    {"area": "서울", "name": ("롯데시네마 수락산", 37.67657671, 127.0556311)},
    {"area": "서울", "name": ("롯데시네마 수유", 37.63569725, 127.0238146)},
    {"area": "서울", "name": ("롯데시네마 신도림", 37.50895312, 126.8889372)},
    {"area": "서울", "name": ("롯데시네마 신림", 37.48371688, 126.9301936)},
    {"area": "서울", "name": ("롯데시네마 에비뉴엘(명동)", 37.56429654, 126.9818448)},
    {"area": "서울", "name": ("롯데시네마 영등포", 37.51626572, 126.9078459)},
    {"area": "서울", "name": ("롯데시네마 용산(전자랜드)", 37.53294726, 126.9601387)},
    {"area": "서울", "name": ("롯데시네마 월드타워", 37.51400142, 127.1041704)},
    {"area": "서울", "name": ("롯데시네마 은평(롯데몰)", 37.63692895, 126.9180184)},
    {"area": "서울", "name": ("롯데시네마 장안", 37.57175859, 127.0722633)},
    {"area": "서울", "name": ("롯데시네마 중랑", 37.61511287, 127.0759773)},
    {"area": "서울", "name": ("롯데시네마 청량리", 37.58044047, 127.0476086)},
    {"area": "서울", "name": ("롯데시네마 합정", 37.55145759, 126.9133907)},
    {"area": "서울", "name": ("롯데시네마 홍대입구", 37.55707507, 126.9248829)},

    {"area": "경상남도", "name": ("CGV 거제", 34.89119747, 128.6161666)},
    {"area": "경상남도", "name": ("CGV 고성", 34.97705011, 128.3159735)},
    {"area": "경상남도", "name": ("CGV 김해", 35.24220434, 128.8686045)},
    {"area": "경상남도", "name": ("CGV 김해율하", 35.17001432, 128.8134966)},
    {"area": "경상남도", "name": ("CGV 김해장유", 35.19194316, 128.8021295)},
    {"area": "경상남도", "name": ("CGV 마산", 35.23757631, 128.5823581)},
    {"area": "경상남도", "name": ("CGV 양산물금", 35.31801818, 129.0018878)},
    {"area": "경상남도", "name": ("CGV 양산삼호", 35.41382563, 129.1677540)},
    {"area": "경상남도", "name": ("CGV 진주혁신", 35.18068764, 128.1438032)},
    {"area": "경상남도", "name": ("CGV 창원", 35.23459229, 128.6420251)},
    {"area": "경상남도", "name": ("CGV 창원더시티", 35.24042892, 128.6537155)},
    {"area": "경상남도", "name": ("CGV 창원상남", 35.22278838, 128.6811896)},
    {"area": "경상남도", "name": ("CGV 통영", 34.85730980, 128.4255821)},
    {"area": "경상남도", "name": ("CGV 마산", 35.23459229, 128.6420251)},
    {"area": "경상북도", "name": ("CGV 경산", 35.83306434, 128.7366695)},
    {"area": "경상북도", "name": ("CGV 구미", 36.13011869, 128.3276838)},
    {"area": "경상북도", "name": ("CGV 김천율곡", 36.11496359, 128.1833893)},
    {"area": "경상북도", "name": ("CGV 북포항", 36.04068640, 129.3681692)},
    {"area": "경상북도", "name": ("CGV 안동", 36.56113333, 128.7493630)},
    {"area": "경상북도", "name": ("CGV 포항", 36.04068640, 129.3681692)},
    {"area": "전라북도", "name": ("CGV 군산", 35.96430078, 126.7055355)},
    {"area": "전라북도", "name": ("CGV 서전주", 35.81681800, 127.1064491)},
    {"area": "전라북도", "name": ("CGV 익산", 35.95804048, 126.9737682)},
    {"area": "전라북도", "name": ("CGV 전주고사", 35.82038545, 127.1419577)},
    {"area": "전라북도", "name": ("CGV 전주효자", 35.80686967, 127.1154508)},
    {"area": "전라북도", "name": ("CGV 정읍", 35.56985217, 126.8495986)},
    {"area": "전라남도", "name": ("CGV 광양", 34.93551874, 127.7230033)},
    {"area": "전라남도", "name": ("CGV 광양엘에프스퀘어", 34.96313117, 127.5666530)},
    {"area": "전라남도", "name": ("CGV 나주", 35.02388603, 126.7930172)},
    {"area": "전라남도", "name": ("CGV 목포", 34.80249258, 126.4199602)},
    {"area": "전라남도", "name": ("CGV 순천", 34.95076167, 127.4863678)},
    {"area": "전라남도", "name": ("CGV 순천신대", 34.92597189, 127.5523701)},
    {"area": "전라남도", "name": ("CGV 여수웅천", 34.74875470, 127.6787548)},
    {"area": "광주", "name": ("CGV 광주금남로", 35.14679560, 126.9146994)},
    {"area": "광주", "name": ("CGV 광주상무", 35.15429464, 126.8510127)},
    {"area": "광주", "name": ("CGV 광주용봉", 35.18268574, 126.9119611)},
    {"area": "광주", "name": ("CGV 광주첨단", 35.21635257, 126.8507258)},
    {"area": "광주", "name": ("CGV 광주충장로", 35.14899749, 126.9132287)},
    {"area": "광주", "name": ("CGV 광주터미널", 35.16069881, 126.8811977)},
    {"area": "광주", "name": ("CGV 광주하남", 35.17807889, 126.8064738)},
    {"area": "제주도", "name": ("CGV 제주", 33.50008571, 126.5272961)},
    {"area": "제주도", "name": ("CGV 제주노형", 33.48583515, 126.4783112)},
    {"area": "부산", "name": ("CGV 대연", 35.13733063, 129.0990291)},
    {"area": "부산", "name": ("CGV 동래", 35.22146855, 129.0855257)},
    {"area": "부산", "name": ("CGV 서면", 35.14928413, 129.0635460)},
    {"area": "부산", "name": ("CGV 서면삼정타워", 35.15301351, 129.0596068)},
    {"area": "부산", "name": ("CGV 샌텀시티", 35.16911725, 129.13033955)},
    {"area": "부산", "name": ("CGV 아시아드", 35.19126834, 129.06200805)},
    {"area": "부산", "name": ("CGV 정관", 35.32140906, 129.1783848)},
    {"area": "부산", "name": ("CGV 하단아트몰링", 35.10659520, 128.96635646)},
    {"area": "부산", "name": ("CGV 해운대", 35.16284921, 129.1584108)},
    {"area": "부산", "name": ("CGV 화명", 35.23473756, 129.0098865)},
    {"area": "부산", "name": ("CGV CINE de CHEF 센텀시티", 35.16911725, 129.1303395)},
    {"area": "울산", "name": ("CGV 울산삼산", 35.54122747, 129.3389203)},
    {"area": "울산", "name": ("CGV 울산신천", 35.63497370, 129.3557682)},
    {"area": "울산", "name": ("CGV 울산진장", 35.57584630, 129.3559235)},
    {"area": "대구", "name": ("CGV 대구수성", 35.82107317, 128.6406618)},
    {"area": "대구", "name": ("CGV 대구스타디움", 35.83165877, 128.6873259)},
    {"area": "대구", "name": ("CGV 대구아카데미", 35.86992754, 128.5942255)},
    {"area": "대구", "name": ("CGV 대구연경", 35.94145444, 128.6228681)},
    {"area": "대구", "name": ("CGV 대구월성", 35.82456314, 128.5268291)},
    {"area": "대구", "name": ("CGV 대구이시아", 35.92183631, 128.6361825)},
    {"area": "대구", "name": ("CGV 대구칠곡", 35.94431364, 128.5601592)},
    {"area": "대구", "name": ("CGV 대구한일", 35.87063433, 128.5952892)},
    {"area": "대구", "name": ("CGV 대구현대", 35.86683018, 128.5910414)},
    {"area": "대전", "name": ("CGV 대전", 35.82107317, 128.6406618)},
    {"area": "대전", "name": ("CGV 대전가수원", 35.83165877, 128.6873259)},
    {"area": "대전", "name": ("CGV 대전가오", 35.83165877, 128.6873259)},
    {"area": "대전", "name": ("CGV 대전탄방", 35.83165877, 128.6873259)},
    {"area": "대전", "name": ("CGV 대전터미널", 35.83165877, 128.6873259)},
    {"area": "세종", "name": ("CGV 세종점", 6.50244595, 127.2475678)},
    {"area": "충청남도", "name": ("CGV 논산", 36.18286226, 127.0977020)},
    {"area": "충청남도", "name": ("CGV 당진", 36.90198286, 126.6301998)},
    {"area": "충청남도", "name": ("CGV 보령", 36.34957822, 126.5928582)},
    {"area": "충청남도", "name": ("CGV 서산", 36.77821123, 126.4565022)},
    {"area": "충청남도", "name": ("CGV 천안", 36.80765878, 127.1483828)},
    {"area": "충청남도", "name": ("CGV 천안시청", 36.81912646, 127.1100960)},
    {"area": "충청남도", "name": ("CGV 천안터미널", 36.81955812, 127.1552987)},
    {"area": "충청남도", "name": ("CGV 천안팬타포트", 36.79855251, 127.1017637)},
    {"area": "충청남도", "name": ("CGV 홍성", 36.60134371, 126.6766000)},
    {"area": "충청북도", "name": ("CGV 청주", 36.63508469, 127.4869607)},
    {"area": "충청북도", "name": ("CGV 청주성안길", 36.63527393, 127.4882802)},
    {"area": "충청북도", "name": ("CGV 청주율량", 36.66606015, 127.4943593)},
    {"area": "충청북도", "name": ("CGV 청주지웰시티", 36.64344719, 127.4278071)},
    {"area": "충청북도", "name": ("CGV 청주터미널", 36.62621464, 127.4311217)},
    {"area": "충청북도", "name": ("CGV 충북혁신", 36.90803986, 127.5405798)},
    {"area": "충청북도", "name": ("CGV 충주교현", 36.98101459, 127.9278475)},
    {"area": "강원도", "name": ("CGV 강릉", 37.75562402, 128.8982380)},
    {"area": "강원도", "name": ("CGV 원주", 37.34455114, 127.9308486)},
    {"area": "강원도", "name": ("CGV 인제", 38.06138402, 128.1647131)},
    {"area": "강원도", "name": ("CGV 춘천", 37.85054899, 127.7437840)},
    {"area": "인천", "name": ("CGV 계양", 37.53388480, 126.7346285)},
    {"area": "인천", "name": ("CGV 부평", 37.52198692, 126.7038493)},
    {"area": "인천", "name": ("CGV 송도타임스페이스", 37.38311006, 126.6423685)},
    {"area": "인천", "name": ("CGV 연수역", 37.41761118, 126.6772237)},
    {"area": "인천", "name": ("CGV 인천", 37.45141207, 126.7020483)},
    {"area": "인천", "name": ("CGV 인천논현", 37.40227269, 126.7086039)},
    {"area": "인천", "name": ("CGV 인천도화", 37.46953716, 126.6645432)},
    {"area": "인천", "name": ("CGV 인천연수", 37.40635533, 126.6830889)},
    {"area": "인천", "name": ("CGV 인천학익", 37.44562005, 126.6518237)},
    {"area": "인천", "name": ("CGV 주안역", 37.46555211, 126.6805106)},
    {"area": "인천", "name": ("CGV 청라", 37.53224140, 126.6412164)},
    {"area": "인천", "name": ("CGV DRIVE IN스퀘어원", 37.40408837, 126.6824162)},
    {"area": "경기도", "name": ("CGV 경기광주", 37.40763278, 127.2584873)},
    {"area": "경기도", "name": ("CGV 광교", 37.28541994, 127.0574664)},
    {"area": "경기도", "name": ("CGV 광교상현", 37.29681878, 127.0680193)},
    {"area": "경기도", "name": ("CGV 구리", 37.60184142, 127.1421478)},
    {"area": "경기도", "name": ("CGV 기흥", 37.28030699, 127.1177327)},
    {"area": "경기도", "name": ("CGV 김포", 37.60682053, 126.7230219)},
    {"area": "경기도", "name": ("CGV 김포운양", 37.65471277, 126.6841260)},
    {"area": "경기도", "name": ("CGV 김포풍무", 37.60996215, 126.7241224)},
    {"area": "경기도", "name": ("CGV 김포한강", 37.63221988, 126.7072144)},
    {"area": "경기도", "name": ("CGV 동백", 37.27839769, 127.1517712)},
    {"area": "경기도", "name": ("CGV 동수원", 37.26390632, 127.0323100)},
    {"area": "경기도", "name": ("CGV 동탄", 37.20530975, 127.0694139)},
    {"area": "경기도", "name": ("CGV 동탄역", 37.20208158, 127.0982702)},
    {"area": "경기도", "name": ("CGV 동탄호수공원", 37.17163720, 127.1061442)},
    {"area": "경기도", "name": ("CGV 배곧", 37.36805681, 126.7304203)},
    {"area": "경기도", "name": ("CGV 범계", 37.38939117, 126.7241224)},
    {"area": "경기도", "name": ("CGV 부천", 37.50436023, 126.7604963)},
    {"area": "경기도", "name": ("CGV 부천역", 37.48588058, 126.7809053)},
    {"area": "경기도", "name": ("CGV 부천옥길", 37.46739492, 126.8236343)},
    {"area": "경기도", "name": ("CGV 북수원", 37.30354450, 127.0074839)},
    {"area": "경기도", "name": ("CGV 산본", 37.35867155, 126.9328786)},
    {"area": "경기도", "name": ("CGV 서현", 7.387345072, 127.1220802)},
    {"area": "경기도", "name": ("CGV 성남모란", 37.43138952, 127.1297670)},
    {"area": "경기도", "name": ("CGV 소풍", 37.50473354, 126.757113)},
    {"area": "경기도", "name": ("CGV 수원", 37.26653006, 127.0002649)},
    {"area": "경기도", "name": ("CGV 스타필드시티위례", 37.48003667, 127.1483973)},
    {"area": "경기도", "name": ("CGV 시흥", 37.44690088, 126.7917414)},
    {"area": "경기도", "name": ("CGV 안산", 37.31309641, 126.8308090)},
    {"area": "경기도", "name": ("CGV 안성", 37.01227713, 127.2571899)},
    {"area": "경기도", "name": ("CGV 야탑", 37.41348673, 127.1277209)},
    {"area": "경기도", "name": ("CGV 양주옥정", 37.81935188, 127.0920866)},
    {"area": "경기도", "name": ("CGV 역곡", 37.48429643, 126.8110668)},
    {"area": "경기도", "name": ("CGV 오리", 37.34079033, 127.1067734)},
    {"area": "경기도", "name": ("CGV 오산", 37.14608820, 127.0703840)},
    {"area": "경기도", "name": ("CGV 오산중앙", 37.14211510, 127.0709296)},
    {"area": "경기도", "name": ("CGV 용인", 37.23508789, 127.2056956)},
    {"area": "경기도", "name": ("CGV 의정부", 37.73806976, 37.73806976)},
    {"area": "경기도", "name": ("CGV 의정부태흥", 37.73811812, 127.0441414)},
    {"area": "경기도", "name": ("CGV 이천", 37.27964401, 127.4441569)},
    {"area": "경기도", "name": ("CGV 일산", 37.65501199, 126.7725922)},
    {"area": "경기도", "name": ("CGV 정왕", 37.34577716, 126.7372331)},
    {"area": "경기도", "name": ("CGV 죽전", 37.32538253, 127.1079487)},
    {"area": "경기도", "name": ("CGV 파주문산", 37.86674231, 126.7841261)},
    {"area": "경기도", "name": ("CGV 파주야당", 37.71313712, 126.7600924)},
    {"area": "경기도", "name": ("CGV 판교", 37.39324423, 127.1118900)},
    {"area": "경기도", "name": ("CGV 평촌", 37.39305686, 126.9622095)},
    {"area": "경기도", "name": ("CGV 평택", 36.99049225, 127.0851647)},
    {"area": "경기도", "name": ("CGV 평택소사", 37.00046165, 127.1114888)},
    {"area": "경기도", "name": ("CGV 포천", 37.82947697, 127.1498441)},
    {"area": "경기도", "name": ("CGV 하남미사", 37.56359268, 127.1922604)},
    {"area": "경기도", "name": ("CGV 화성봉담", 37.21906094, 126.9555183)},
    {"area": "경기도", "name": ("CGV 화정", 37.63577272, 126.8331753)},
    {"area": "서울", "name": ("CGV 강남", 37.50165739, 127.0263911)},
    {"area": "서울", "name": ("CGV 강변", 37.53540562, 127.0956556)},
    {"area": "서울", "name": ("CGV 건대입구", 37.53975383, 127.0668669)},
    {"area": "서울", "name": ("CGV 구로", 37.50145745, 126.8822081)},
    {"area": "서울", "name": ("CGV 대학문", 37.58345669, 126.9998414)},
    {"area": "서울", "name": ("CGV 동대문", 37.56855039, 127.0075205)},
    {"area": "서울", "name": ("CGV 등촌", 37.55787249, 126.8559879)},
    {"area": "서울", "name": ("CGV 명동", 37.56349296, 126.9825830)},
    {"area": "서울", "name": ("CGV 명동역씨네라이브러리", 37.56132014, 126.9854334)},
    {"area": "서울", "name": ("CGV 목동", 37.52635005, 126.8748834)},
    {"area": "서울", "name": ("CGV 미아", 37.61205736, 127.0307158)},
    {"area": "서울", "name": ("CGV 불광", 37.60947048, 126.9291815)},
    {"area": "서울", "name": ("CGV 상봉", 37.59762483, 127.0921864)},
    {"area": "서울", "name": ("CGV 성신여대입구", 37.592595130, 127.0170478)},
    {"area": "서울", "name": ("CGV 송파", 37.47697881, 127.1257340)},
    {"area": "서울", "name": ("CGV 수유", 37.64239065, 127.0298417)},
    {"area": "서울", "name": ("CGV 신촌아트레오", 37.55663873, 126.9401982)},
    {"area": "서울", "name": ("CGV 압구정", 37.52436198, 127.0294038)},
    {"area": "서울", "name": ("CGV 여의도", 37.52569010, 126.9255841)},
    {"area": "서울", "name": ("CGV 연남", 37.55766676, 126.9258918)},
    {"area": "서울", "name": ("CGV 영등포", 37.51751763, 126.9027564)},
    {"area": "서울", "name": ("CGV 왕십리", 37.56178346, 127.0379502)},
    {"area": "서울", "name": ("CGV 용산아이파크몰", 37.52975174, 126.9639508)},
    {"area": "서울", "name": ("CGV 중계", 37.63966557, 127.0687736)},
    {"area": "서울", "name": ("CGV 천호", 37.54591833, 127.1423041)},
    {"area": "서울", "name": ("CGV 청담씨네씨티", 37.52295067, 127.0370323)},
    {"area": "서울", "name": ("CGV 피카디리1958", 37.57101183, 126.9913110)},
    {"area": "서울", "name": ("CGV 하계", 37.63879939, 127.0645808)},
    {"area": "서울", "name": ("CGV 홍대", 37.55650238, 126.9226245)},
    {"area": "서울", "name": ("CGV CINE de CHEF 압구정", 37.52436198, 127.0294038)},
    {"area": "서울", "name": ("CGV CINE de CHEF 용산아이파크몰", 37.52975174, 126.9639508)},

    {"area": "경상남도", "name": ("메가박스 마산", 35.18147426, 128.5640531)},
    {"area": "경상남도", "name": ("메가박스 삼천포", 34.948971097, 128.0377142)},
    {"area": "경상남도", "name": ("메가박스 양산", 35.338269385, 129.0269382)},
    {"area": "경상남도", "name": ("메가박스 양산라피에스타", 35.310276587, 129.0095333)},
    {"area": "경상남도", "name": ("메가박스 창원", 35.221370938, 128.6756537)},
    {"area": "경상남도", "name": ("메가박스 창원내서", 35.248973219, 128.5106563)},
    {"area": "경상북도", "name": ("메가박스 경북도청", 36.575163097, 128.4930944)},
    {"area": "경상북도", "name": ("메가박스 경산햐양", 35.913635266, 128.8232196)},
    {"area": "경상북도", "name": ("메가박스 구미강동", 36.107176543, 128.4178788)},
    {"area": "경상북도", "name": ("메가박스 김천", 36.125295864, 128.1107879)},
    {"area": "경상북도", "name": ("메가박스 남포항", 35.974493572, 129.4034283)},
    {"area": "경상북도", "name": ("메가박스 문경", 36.587455621, 128.1903728)},
    {"area": "대구", "name": ("메가박스 대구", 35.88515681, 128.5901501)},
    {"area": "대구", "name": ("메가박스 대구신세계", 35.87772738, 128.6297075)},
    {"area": "대구", "name": ("메가박스 대구이시아", 35.92079536, 128.6358619)},
    {"area": "대구", "name": ("메가박스 북대구(칠곡)", 35.944075217, 128.5617237)},
    {"area": "부산", "name": ("메가박스 덕천", 35.210994223, 129.0075760)},
    {"area": "부산", "name": ("메가박스 부산극장", 35.098615932, 129.0286994)},
    {"area": "부산", "name": ("메가박스 부산대", 35.230107365, 129.0881148)},
    {"area": "부산", "name": ("메가박스 정관", 35.319442113, 129.1784244)},
    {"area": "부산", "name": ("메가박스 해운대", 35.170262399, 129.1769121)},
    {"area": "울산", "name": ("메가박스 울산", 35.55436006, 129.3210866)},
    {"area": "전라북도", "name": ("메가박스 송천", 35.86946485, 127.1143634)},
    {"area": "전라북도", "name": ("메가박스 전주혁신", 35.83922517, 127.0593073)},
    {"area": "전라남도", "name": ("메가박스 목포하당", 34.80745648, 126.4262160)},
    {"area": "전라남도", "name": ("메가박스 순천", 34.94132636, 127.5108824)},
    {"area": "전라남도", "name": ("메가박스 여수웅천", 34.74909622, 127.6789367)},
    {"area": "광주", "name": ("메가박스 광주상무", 35.15419510, 126.8543931)},
    {"area": "광주", "name": ("메가박스 광주하남", 35.16273322, 126.8115668)},
    {"area": "광주", "name": ("메가박스 전대(광주)", 35.17257648, 126.9124485)},
    {"area": "광주", "name": ("메가박스 첨단", 35.22142109, 126.8523806)},
    {"area": "제주도", "name": ("메가박스 제주", 33.51162803, 126.52268211)},
    {"area": "대전", "name": ("메가박스 대전", 36.34696357, 127.3880121)},
    {"area": "대전", "name": ("메가박스 대전신세계아트앤사이언스", 36.37542418, 127.3808062)},
    {"area": "대전", "name": ("메가박스 대전유성", 36.35228393, 127.3445589)},
    {"area": "대전", "name": ("메가박스 대전중앙로", 36.32753570, 127.4241759)},
    {"area": "대전", "name": ("메가박스 대전현대아울렛", 36.423853529, 127.3972169)},
    {"area": "충청남도", "name": ("메가박스 공주", 36.47356495, 127.1389174)},
    {"area": "충청남도", "name": ("메가박스 논산", 36.18976791, 127.0991581)},
    {"area": "충청남도", "name": ("메가박스 홍성내포", 36.65937961, 126.6789836)},
    {"area": "충청남도", "name": ("메가박스 오창", 36.71242042, 127.4284768)},
    {"area": "충청남도", "name": ("메가박스 제천", 37.13527754, 128.2123497)},
    {"area": "충청남도", "name": ("메가박스 진천", 36.85960450, 127.4381594)},
    {"area": "충청남도", "name": ("메가박스 청주사창", 36.63273006, 127.4604384)},
    {"area": "충청남도", "name": ("메가박스 충주", 36.97048146, 127.9331122)},
    {"area": "세종", "name": ("메가박스 세종(조치원)", 36.60286214, 127.2981695)},
    {"area": "세종", "name": ("메가박스 세종나성", 36.48351969, 127.2636307)},
    {"area": "강원도", "name": ("메가박스 남춘천", 37.86653153, 127.7200155)},
    {"area": "강원도", "name": ("메가박스 속초", 38.18908568, 128.5859124)},
    {"area": "강원도", "name": ("메가박스 원주", 37.34499029, 127.9297706)},
    {"area": "강원도", "name": ("메가박스 원주센트럴", 37.32809812, 127.9861069)},
    {"area": "인천", "name": ("메가박스 검단", 37.58795142, 126.6754049)},
    {"area": "인천", "name": ("메가박스 송도", 37.37914502, 126.6624149)},
    {"area": "인천", "name": ("메가박스 영종", 37.49226457, 126.4987768)},
    {"area": "인천", "name": ("메가박스 인천논현", 37.39740519, 126.7274151)},
    {"area": "인천", "name": ("메가박스 청라지젤", 37.53376043, 126.6557273)},
    {"area": "경기도", "name": ("메가박스 고양스타필드", 37.64664916, 126.8926780)},
    {"area": "경기도", "name": ("메가박스 김포한강신도시", 37.64508051, 126.6245120)},
    {"area": "경기도", "name": ("메가박스 남양주", 37.65482184, 127.2441088)},
    {"area": "경기도", "name": ("메가박스 남양주현대아울렛 스페이스원", 37.61654331, 127.1526030)},
    {"area": "경기도", "name": ("메가박스 동탄", 37.20454270, 127.0728264)},
    {"area": "경기도", "name": ("메가박스 미사강변", 37.56623221, 127.1897171)},
    {"area": "경기도", "name": ("메가박스 백석", 37.64385926, 126.7898784)},
    {"area": "경기도", "name": ("메가박스 별내", 37.65590906, 127.1267909)},
    {"area": "경기도", "name": ("메가박스 부천스타필드시티", 37.46124428, 126.8140071)},
    {"area": "경기도", "name": ("메가박스 분당", 37.38560031, 127.1224477)},
    {"area": "경기도", "name": ("메가박스 수원", 37.25133229, 127.0199599)},
    {"area": "경기도", "name": ("메가박스 수원남문", 37.27644494, 127.0159434)},
    {"area": "경기도", "name": ("메가박스 시흥배곧", 37.36970438, 126.7306402)},
    {"area": "경기도", "name": ("메가박스 안산중앙", 37.31804428, 126.8354956)},
    {"area": "경기도", "name": ("메가박스 안성스타필드", 36.99472957, 127.1458471)},
    {"area": "경기도", "name": ("메가박스 양주", 37.79629611, 127.0800795)},
    {"area": "경기도", "name": ("메가박스 영통", 37.25255223, 127.0714771)},
    {"area": "경기도", "name": ("메가박스 용인기흥", 37.22367971, 127.1143658)},
    {"area": "경기도", "name": ("메가박스 용인테크노밸리", 37.29127994, 127.1481250)},
    {"area": "경기도", "name": ("메가박스 의정부민락", 37.74569512, 127.0959404)},
    {"area": "경기도", "name": ("메가박스 일산", 37.68947234, 126.7571019)},
    {"area": "경기도", "name": ("메가박스 일산벨라시티", 37.20076911, 127.0978281)},
    {"area": "경기도", "name": ("메가박스 킨텍스", 37.66794584, 126.7517361)},
    {"area": "경기도", "name": ("메가박스 파주금촌", 37.76488408, 126.7746418)},
    {"area": "경기도", "name": ("메가박스 파주운정", 37.70572549, 126.7586546)},
    {"area": "경기도", "name": ("메가박스 파주출판도시", 37.71382643, 126.6877812)},
    {"area": "경기도", "name": ("메가박스 하남스타필드", 37.54464623, 127.2250623)},
    {"area": "서울", "name": ("메가박스 강남", 37.49795605, 127.0264170)},
    {"area": "서울", "name": ("메가박스 강남대로", 37.50038145, 127.0268973)},
    {"area": "서울", "name": ("메가박스 강동", 37.52847627, 127.1252490)},
    {"area": "서울", "name": ("메가박스 군자", 37.55566202, 127.0783342)},
    {"area": "서울", "name": ("메가박스 동대문", 37.56677002, 127.0075939)},
    {"area": "서울", "name": ("메가박스 마곡", 37.55931399, 126.8352382)},
    {"area": "서울", "name": ("메가박스 목동", 37.52883086, 126.8760694)},
    {"area": "서울", "name": ("메가박스 상봉", 37.56153300, 126.8535916)},
    {"area": "서울", "name": ("메가박스 사암월드컵경기장", 37.56153300, 126.8535916)},
    {"area": "서울", "name": ("메가박스 성수", 37.59303398, 127.0747772)},
    {"area": "서울", "name": ("메가박스 센트럴", 37.50519942, 127.0039086)},
    {"area": "서울", "name": ("메가박스 송파파크하비오", 37.48209765, 127.1238306)},
    {"area": "서울", "name": ("메가박스 신촌", 37.55957051, 126.9418766)},
    {"area": "서울", "name": ("메가박스 이수", 37.48457221, 126.9816493)},
    {"area": "서울", "name": ("메가박스 창동", 37.65457702, 127.0387192)},
    {"area": "서울", "name": ("메가박스 코엑스", 37.51307794, 127.0582151)},
    {"area": "서울", "name": ("메가박스 홍대", 37.55604249, 126.9220455)},
    {"area": "서울", "name": ("메가박스 화곡", 37.54065597, 126.8377234)},
    {"area": "서울", "name": ("메가박스 ARTNINE", 37.48457221, 126.9816493)}
])